debug_request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
               xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
               xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    
    <GetLegislativeStatusChanges xmlns="http://WSLWebServices.leg.wa.gov/">
      <biennium>2025-26</biennium>
      <beginDate>2025-12-01T00:00:00</beginDate>
      <endDate>2026-01-17T02:33:42.393623</endDate>
    </GetLegislativeStatusChanges>
  </soap:Body>
</soap:Envelope>